app/controllers/shop/deposits_controller.rb

SELECT COUNT(*) FROM `deposits` WHERE `deposits`.`shop_id` = 1 AND `deposits`.`deposited_at` BETWEEN '2021-10-08 15:00:00' AND '2021-10-09 14:59:59'
SELECT `deposits`.* FROM `deposits` WHERE `deposits`.`shop_id` = 1 AND `deposits`.`deposited_at` BETWEEN '2021-10-07 15:00:00' AND '2021-10-08 14:59:59' LIMIT 11
---
  def index
    @start_at = (Time.zone.parse(params[:start_at].to_s) || Time.zone.now).beginning_of_day
    @end_at = (Time.zone.parse(params[:end_at].to_s) || Time.zone.now).end_of_day
    @deposits = Deposit.where(shop: current_shop, deposited_at: @start_at..@end_at).page(params[:page]).per(10)