app/controllers/shop/home_controller.rb

  def index
    @deposits = Deposit.where(shop: current_shop, deposited_at: Time.zone.now.all_day)
    @deposit_usages = DepositUsage.where(shop: current_shop, used_at: Time.zone.now.all_day)
---
SELECT `deposits`.* FROM `deposits` WHERE `deposits`.`shop_id` = 1 AND `deposits`.`deposited_at` BETWEEN '2021-09-29 00:00:00' AND '2021-09-29 23:59:59'
SELECT `deposit_usages`.* FROM `deposit_usages` WHERE `deposit_usages`.`shop_id` = 1 AND `deposit_usages`.`used_at` BETWEEN '2021-09-29 00:00:00' AND '2021-09-29 23:59:59'