app/controllers/shop/usages_controller.rb

  def index
    @start_at = (Time.zone.parse(params[:start_at].to_s) || Time.zone.now).beginning_of_day
    @end_at = (Time.zone.parse(params[:end_at].to_s) || Time.zone.now).end_of_day
    @deposit_usages = DepositUsage.where(shop: current_shop, used_at: @start_at..@end_at).page(params[:page]).per(10)
---
SELECT COUNT(*) FROM `deposit_usages` WHERE `deposit_usages`.`shop_id` = 1 AND `deposit_usages`.`used_at` BETWEEN '2021-09-30 15:00:00' AND '2021-10-24 14:59:59'
SELECT `deposit_usages`.* FROM `deposit_usages` WHERE `deposit_usages`.`shop_id` = 1 AND `deposit_usages`.`used_at` BETWEEN '2021-10-07 15:00:00' AND '2021-10-08 14:59:59' LIMIT 11