app/views/payment/new.html.erb

                <ul class="list-group list-group-flush">
                  <% @current_shop.shop_deposit_patterns.each do |pattern| %>
---
SELECT `shop_deposit_patterns`.* FROM `shop_deposit_patterns` WHERE `shop_deposit_patterns`.`shop_id` = 1