app/controllers/deposits_controller.rb

  def index
    @deposits = current_user.deposits.includes(:shop, :deposit_usages).group_by(&:shop)
---
SELECT `deposit_usages`.* FROM `deposit_usages` WHERE `deposit_usages`.`deposit_id` IN (1, 2, 3)
SELECT `deposits`.* FROM `deposits` WHERE `deposits`.`user_id` = 1
SELECT `shops`.* FROM `shops` WHERE `shops`.`id` IN (1, 2)

  def new
    @shop = Shop.find_by(id: params[:shop_id].to_i)
---
SELECT `shops`.* FROM `shops` WHERE `shops`.`id` = 1 LIMIT 1

  def history
    @shop = Shop.find(params[:shop_id].to_i)
    @deposits = current_user.deposits.includes(:deposit_usages).where(shop: @shop) || []
---
SELECT `shops`.* FROM `shops` WHERE `shops`.`id` = 1 LIMIT 1
SELECT `deposit_usages`.* FROM `deposit_usages` WHERE `deposit_usages`.`deposit_id` IN (1, 2)
SELECT `deposits`.* FROM `deposits` WHERE `deposits`.`user_id` = 1 AND `deposits`.`shop_id` = 1