app/controllers/payment_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def new
    user_id = params[:user_id]
    @user = User.find(user_id)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def create
    user_id = params[:user_id]
    @user = User.find(user_id)

SELECT `shop_deposit_patterns`.* FROM `shop_deposit_patterns` WHERE `shop_deposit_patterns`.`id` = 0 LIMIT 1
---
  def new_deposit
    shop_deposit_pattern_id = params[:shop_deposit_pattern_id].to_i
    pattern = ShopDepositPattern.find(shop_deposit_pattern_id)