app/models/user.rb

INSERT INTO `deposit_usages` (`user_id`, `deposit_id`, `shop_id`, `shop_administrator_id`, `amount`, `used_at`, `created_at`, `updated_at`) VALUES (1, 1, 1, 1, 500, '2021-09-29 11:46:05', '2021-09-29 11:46:05.441599', '2021-09-29 11:46:05.441599')
INSERT INTO `deposit_usages` (`user_id`, `deposit_id`, `shop_id`, `shop_administrator_id`, `amount`, `used_at`, `created_at`, `updated_at`) VALUES (1, 2, 1, 1, 300, '2021-10-24 09:03:43', '2021-10-24 09:03:43.878988', '2021-10-24 09:03:43.878988')
---
  def consume(shop, amount, shop_administrator)
    fail if amount <= 0
    remain = amount
    deposits = deposites_at(shop)
    deposit_usages = []
    deposits.each do |deposit|
      balance = deposit.balance
      if balance > 0
        if balance >= remain
          deposit_usages << deposit.deposit_usages.create(user: self, shop: shop, shop_administrator: shop_administrator, amount: remain, used_at: Time.now)
          remain = 0
          break
        else
          deposit_usages << deposit.deposit_usages.create(user: self, shop: shop, shop_administrator: shop_administrator, amount: balance, used_at: Time.now)

INSERT INTO `deposits` (`user_id`, `shop_id`, `shop_administrator_id`, `amount`, `bonus_amount`, `deposited_at`, `created_at`, `updated_at`) VALUES (1, 1, 1, 20000, 2100, '2021-10-24 07:50:16', '2021-10-24 07:50:16.304896', '2021-10-24 07:50:16.304896')
---
  def deposit(shop, pattern, shop_administrator)
    deposits.create(shop: shop, shop_administrator: shop_administrator, amount: pattern.amount, bonus_amount: pattern.bonus_amount, deposited_at: Time.now)